Repository: bottledcode/peers
Catalog: languages/*.po
Languages: nl

source: Page not found
nl: Pagina niet gevonden

source: Sorry, we couldn’t find the page you’re looking for.
nl: Sorry, we konden de pagina die u zocht niet vinden.

source: Go back home
nl: Ga terug naar huis

source: A simple, asynchronous peer review tool.
nl: Een eenvoudig, asynchroon hulpmiddel voor intercollegiale toetsing.

source: Login
nl: Inloggen

source: See your reviews
nl: Bekijk uw beoordelingen

source: Peer review for %s
nl: Peer review voor %s

source: %1$s %2$s is asking for professional feedback. Please be honest and constructive. Your review will be anonymous unless you share your name in the review text.
nl: %1$s %2$s vraagt om professionele feedback. Wees alstublieft eerlijk en constructief. Uw beoordeling is anoniem tenzij u uw naam in de beoordelingstekst vermeldt.

source: Feel free to schedule some 1:1 time together, if you prefer to give feedback face-to-face.
nl: Voel je vrij om wat 1:1 tijd samen in te plannen als je liever persoonlijke feedback geeft.

source: This page is not tracked. There are no cookies. The IP address is not logged.
nl: Deze pagina wordt niet gevolgd. Er zijn geen cookies. Het IP-adres wordt niet bijgehouden.

source: What is something %s should continue doing?
nl: Wat is iets dat %s zou moeten blijven doen?

source: What is something %s should stop doing?
nl: Wat is iets waarmee %s zou moeten stoppen?

source: What is something %s should start doing?
nl: Wat moet %s nieuw gaan doen?

source: Is there anything else you want %s to know?
nl: Is er nog iets dat u %s wilt laten weten?

source: Send it
nl: Verstuur het

source: Close
nl: Sluiten

source: Want to receive some reviews? Share this link with your peers:
nl: Wilt u beoordelingen ontvangen? Deel deze link met uw collega's:

source: You have a pending review
nl: Je hebt een beoordeling in behandeling

source: (reviews are intentionally delayed to protect the privacy of the reviewer)
nl: (beoordelingen worden opzettelijk uitgesteld om de privacy van de beoordelaar te beschermen)

source: Round: %s
nl: Rond: %s

source: Review number: %s
nl: Beoordelingsnummer: %s

source: Published %s ago
nl: %s geleden geplaatst

source: Discover any issues or have any questions? Email %1$s support %2$s
nl: Problemen ontdekt of vragen? E-mail %1$s ondersteuning %2$s

# time-years
source: y
nl: j

# time-hour
source: h
nl: u

source: Log out
nl: Uitloggen

source: Request A Review
nl: Een beoordeling aanvragen
